nats_kubernetes/introduction.org
# -*- mode: org; mode: auto-fill -*- 
#+TODO:    ONIT HOLD PAUSED TODO | DONE CANCELED
#+TITLE:   Deploying NATS on Kubernetes
#+startup: showeverything

# * TODO COMMENT Pending [0/3]

# - [ ] Connect to your cluster
# - [ ] About the services created
# - [ ] About the artifacts created

* Introduction

The [[https://github.com/nats-io/nats-operator][NATS Operator]] is a 

* Getting started

In order to install the latest version of the operator:

#+BEGIN_SRC sh :results output
$ kubectl apply -f https://github.com/nats-io/nats-operator/releases/latest/download/00-prereqs.yaml
$ kubectl apply -f https://github.com/nats-io/nats-operator/releases/latest/download/10-deployment.yaml
#+END_SRC

# TODO: Confirm

* Creating your first NATS cluster

#+BEGIN_SRC yaml
apiVersion: "nats.io/v1alpha2"
kind: "NatsCluster"
metadata:
  name: "nats-cluster"
spec:
  size: 3
  version: "2.0.0"
#+END_SRC

* Connecting to your cluster

